Repository: SeraVault/usb-enforcer
Catalog: locale/*/LC_MESSAGES/usb-enforcer.po
Languages: es, fr

source: Minimum passphrase length should be at least 8 characters
es: La longitud mínima de la contraseña debe ser de al menos 8 caracteres
fr: La longueur minimale de la phrase secrète doit être d'au moins 8 caractères

source: Maximum passphrase length should not exceed 128 characters
es: La longitud máxima de la contraseña no debe exceder los 128 caracteres
fr: La longueur maximale de la phrase secrète ne doit pas dépasser 128 caractères

source: TTL should be at least 60 seconds
es: El TTL debe ser de al menos 60 segundos
fr: Le TTL doit être d'au moins 60 secondes

source: TTL should not exceed 3600 seconds (1 hour)
es: El TTL no debe exceder los 3600 segundos (1 hora)
fr: Le TTL ne doit pas dépasser 3600 secondes (1 heure)

source: Max tokens should be at least 16
es: Los tokens máximos deben ser al menos 16
fr: Les jetons maximum doivent être au moins 16

source: Max tokens should not exceed 1024
es: Los tokens máximos no deben exceder 1024
fr: Les jetons maximum ne doivent pas dépasser 1024

source: File size cannot be negative (use 0 for unlimited)
es: El tamaño del archivo no puede ser negativo (use 0 para ilimitado)
fr: La taille du fichier ne peut pas être négative (utilisez 0 pour illimité)

source: File size limit should not exceed 10240 MB (10 GB)
es: El límite de tamaño de archivo no debe exceder 10240 MB (10 GB)
fr: La limite de taille de fichier ne doit pas dépasser 10240 Mo (10 Go)

source: Timeout should be at least 5 seconds
es: El tiempo de espera debe ser de al menos 5 segundos
fr: Le délai d'attente doit être d'au moins 5 secondes

source: Timeout should not exceed 300 seconds
es: El tiempo de espera no debe exceder los 300 segundos
fr: Le délai d'attente ne doit pas dépasser 300 secondes

source: Close
es: Cerrar
fr: Fermer

source: USB Enforcer Administration
es: Administración de USB Enforcer
fr: Administration d'USB Enforcer

source: USB Enforcer Configuration
es: Configuración de USB Enforcer
fr: Configuration d'USB Enforcer

source: Save Configuration
es: Guardar Configuración
fr: Enregistrer la Configuration

source: Restart Daemon
es: Reiniciar Demonio
fr: Redémarrer le Démon

source: Restart usb-enforcerd to reload configuration
es: Reiniciar usb-enforcerd para recargar la configuración
fr: Redémarrer usb-enforcerd pour recharger la configuration

source: Documentation
es: Documentación

source: Administration Guide
es: Guía de Administración
fr: Guide d'Administration

source: Content Scanning
es: Escaneo de Contenido
fr: Analyse de Contenu

source: Anti-Evasion
es: Anti-Evasión
fr: Anti-Évasion

source: Group Exemptions
es: Exenciones de Grupo
fr: Exemptions de Groupe

source: Architecture Overview
es: Descripción de la Arquitectura
fr: Aperçu de l'Architecture

source: Testing Guide
es: Guía de Pruebas
fr: Guide de Test

source: Basic Enforcement
es: Aplicación Básica
fr: Application de Base

source: Basic Settings
es: Configuraciones Básicas
fr: Paramètres de Base

source: Core enforcement policies for USB devices
es: Políticas básicas de aplicación para dispositivos USB
fr: Politiques d'application de base pour les périphériques USB

source: Only Enforce on USB Devices
es: Solo Aplicar en Dispositivos USB
fr: Appliquer Uniquement aux Périphériques USB

source: Allow LUKS1 (Read-Only)
es: Permitir LUKS1 (Solo Lectura)
fr: Autoriser LUKS1 (Lecture Seule)

source: Allow Write with Content Scanning
es: Permitir Escritura con Escaneo de Contenido
fr: Autoriser l'Écriture avec Analyse de Contenu

source: Desktop Notifications
es: Notificaciones de Escritorio
fr: Notifications de Bureau

source: Show desktop notifications when USB devices are connected or blocked.
es: Mostrar notificaciones de escritorio cuando se conectan o bloquean dispositivos USB.

source: Minimum Passphrase Length
es: Longitud Mínima de Contraseña
fr: Longueur Minimale de Phrase Secrète

source: Exempted Groups
es: Grupos Exentos
fr: Groupes Exemptés

source: Basic
es: Básico
fr: Base

source: Security Settings
es: Configuraciones de Seguridad
fr: Paramètres de Sécurité

source: Access Control
es: Control de Acceso
fr: Contrôle d'Accès

source: Secret token and socket security settings
es: Configuraciones de seguridad de tokens secretos y sockets
fr: Paramètres de sécurité des jetons secrets et des sockets

source: Token TTL (seconds)
es: TTL de Token (segundos)
fr: TTL du Jeton (secondes)

source: Maximum Outstanding Tokens
es: Tokens Máximos Pendientes
fr: Jetons Maximums en Attente

source: Mount Options
es: Opciones de Montaje
fr: Options de Montage

source: Security flags for mounting USB devices
es: Banderas de seguridad para montar dispositivos USB
fr: Drapeaux de sécurité pour le montage de périphériques USB

source: Plaintext Mount Options
es: Opciones de Montaje Sin Cifrar
fr: Options de Montage en Texte Clair

source: Encrypted Mount Options
es: Opciones de Montaje Cifrado
fr: Options de Montage Chiffré

source: Mount options for encrypted USB devices. Recommended: nodev, nosuid, rw
es: Opciones de montaje para dispositivos USB cifrados. Recomendado: nodev, nosuid, rw

source: Require No-Execute on Plaintext
es: Requerir No-Ejecución en Texto Plano
fr: Exiger Non-Exécution sur Texte Clair

source: Security
es: Seguridad
fr: Sécurité

source: Default settings for USB device encryption
es: Configuraciones predeterminadas para cifrado de dispositivos USB
fr: Paramètres par défaut pour le chiffrement de périphériques USB

source: Filesystem Type
es: Tipo de Sistema de Archivos
fr: Type de Système de Fichiers

source: Key Derivation
es: Derivación de Clave
fr: Dérivation de Clé

source: KDF (Key Derivation Function) settings
es: Configuraciones de KDF (Función de Derivación de Clave)
fr: Paramètres KDF (Fonction de Dérivation de Clé)

source: KDF Algorithm
es: Algoritmo KDF
fr: Algorithme KDF

source: Cipher Settings
es: Configuraciones de Cifrado
fr: Paramètres de Chiffrement

source: Encryption algorithm configuration
es: Configuración del algoritmo de cifrado
fr: Configuration de l'algorithme de chiffrement

source: Cipher Algorithm
es: Algoritmo de Cifrado
fr: Algorithme de Chiffrement

source: Key Size (bits)
es: Tamaño de Clave (bits)
fr: Taille de Clé (bits)

source: Content Scanning (DLP)
es: Escaneo de Contenido (DLP)
fr: Analyse de Contenu (DLP)

source: Data Loss Prevention through real-time content scanning
es: Prevención de Pérdida de Datos mediante escaneo de contenido en tiempo real
fr: Prévention de Perte de Données par analyse de contenu en temps réel

source: Enable Content Scanning
es: Habilitar Escaneo de Contenido
fr: Activer l'Analyse de Contenu

source: Scan Encrypted Devices
es: Escanear Dispositivos Cifrados
fr: Analyser les Périphériques Chiffrés

source: Action on Detection
es: Acción al Detectar
fr: Action lors de la Détection

source: Scan Categories
es: Categorías de Escaneo
fr: Catégories d'Analyse

source: Types of sensitive data to detect
es: Tipos de datos sensibles a detectar
fr: Types de données sensibles à détecter

source: Enabled Categories
es: Categorías Habilitadas
fr: Catégories Activées

source: Financial (credit cards, bank accounts, SWIFT, IBAN)
es: Financiero (tarjetas de crédito, cuentas bancarias, SWIFT, IBAN)
fr: Financier (cartes de crédit, comptes bancaires, SWIFT, IBAN)

source: Personal (SSN, passport, driver license, phone)
es: Personal (SSN, pasaporte, licencia de conducir, teléfono)
fr: Personnel (SSN, passeport, permis de conduire, téléphone)

source: Authentication (API keys, passwords, tokens)
es: Autenticación (claves API, contraseñas, tokens)
fr: Authentification (clés API, mots de passe, jetons)

source: Medical (medical records, insurance IDs)
es: Médico (registros médicos, IDs de seguro)
fr: Médical (dossiers médicaux, IDs d'assurance)

source: Performance Settings
es: Configuraciones de Rendimiento
fr: Paramètres de Performance

source: Scanning performance and limits
es: Rendimiento y límites de escaneo
fr: Performance et limites d'analyse

source: Max File Size (MB)
es: Tamaño Máximo de Archivo (MB)
fr: Taille Maximale de Fichier (Mo)

source: Oversize File Action
es: Acción de Archivo Sobredimensionado
fr: Action Fichier Surdimensionné

source: Streaming Threshold (MB)
es: Umbral de Transmisión (MB)
fr: Seuil de Diffusion (Mo)

source: Large File Scan Mode
es: Modo de Escaneo de Archivos Grandes
fr: Mode d'Analyse de Fichiers Volumineux

source: Scan Timeout (seconds)
es: Tiempo de Espera de Escaneo (segundos)
fr: Délai d'Analyse (secondes)

source: Maximum time to spend scanning a single file.
es: Tiempo máximo para escanear un solo archivo.
fr: Temps maximum pour analyser un seul fichier.

source: Max Concurrent Scans
es: Escaneos Concurrentes Máximos
fr: Analyses Concurrentes Maximales

source: Number of parallel scanning threads.
es: Número de hilos de escaneo paralelos.
fr: Nombre de threads d'analyse parallèles.

source: Advanced Scanning
es: Escaneo Avanzado
fr: Analyse Avancée

source: Archive Scanning
es: Escaneo de Archivos
fr: Analyse d'Archives

source: Scanning files inside archives (ZIP, TAR, 7Z, RAR)
es: Escaneo de archivos dentro de archivos comprimidos (ZIP, TAR, 7Z, RAR)
fr: Analyse de fichiers dans les archives (ZIP, TAR, 7Z, RAR)

source: Scan Archive Contents
es: Escanear Contenido de Archivos
fr: Analyser le Contenu des Archives

source: Max Archive Depth
es: Profundidad Máxima de Archivo
fr: Profondeur Maximale d'Archive

source: Document Scanning
es: Escaneo de Documentos
fr: Analyse de Documents

source: Scanning Office and PDF documents
es: Escaneo de documentos de Office y PDF
fr: Analyse de documents Office et PDF

source: Scan Documents
es: Escanear Documentos
fr: Analyser les Documents

source: Extract and scan text from PDF, DOCX, XLSX, PPTX, ODT files.
es: Extraer y escanear texto de archivos PDF, DOCX, XLSX, PPTX, ODT.
fr: Extraire et analyser le texte des fichiers PDF, DOCX, XLSX, PPTX, ODT.

source: Machine Learning
es: Aprendizaje Automático
fr: Apprentissage Automatique

source: Advanced pattern detection
es: Detección avanzada de patrones
fr: Détection avancée de motifs

source: N-gram Analysis
es: Análisis de N-gramas
fr: Analyse N-gramme

source: Caching
es: Almacenamiento en Caché
fr: Mise en Cache

source: Scan result caching for performance
es: Almacenamiento en caché de resultados de escaneo para rendimiento
fr: Mise en cache des résultats d'analyse pour la performance

source: Enable Scan Cache
es: Habilitar Caché de Escaneo
fr: Activer le Cache d'Analyse

source: Cache Size (MB)
es: Tamaño de Caché (MB)
fr: Taille du Cache (Mo)

source: Maximum size of scan result cache.
es: Tamaño máximo del caché de resultados de escaneo.
fr: Taille maximale du cache de résultats d'analyse.

source: Custom Patterns
es: Patrones Personalizados
fr: Motifs Personnalisés

source: Define enterprise-specific sensitive data patterns
es: Definir patrones de datos sensibles específicos de la empresa
fr: Définir des motifs de données sensibles spécifiques à l'entreprise

source: Manage Custom Patterns
es: Administrar Patrones Personalizados
fr: Gérer les Motifs Personnalisés

source: {} custom pattern(s) defined
es: {} patrón(es) personalizado(s) definido(s)
fr: {} motif(s) personnalisé(s) défini(s)

source: Advanced
es: Avanzado
fr: Avancé

source: Configuration saved to {}
es: Configuración guardada en {}
fr: Configuration enregistrée dans {}

source: Configuration saved. Restart usb-enforcerd to apply changes.
es: Configuración guardada. Reinicie usb-enforcerd para aplicar los cambios.
fr: Configuration enregistrée. Redémarrez usb-enforcerd pour appliquer les changements.

source: Failed to save configuration: {}
es: Error al guardar la configuración: {}
fr: Échec de l'enregistrement de la configuration : {}

source: usb-enforcerd restarted.
es: usb-enforcerd reiniciado.
fr: usb-enforcerd redémarré.

source: systemctl not found; cannot restart service.
es: systemctl no encontrado; no se puede reiniciar el servicio.
fr: systemctl introuvable ; impossible de redémarrer le service.

source: Failed to restart usb-enforcerd: {}
es: Error al reiniciar usb-enforcerd: {}
fr: Échec du redémarrage d'usb-enforcerd : {}

source: Custom Content Patterns
es: Patrones de Contenido Personalizados
fr: Motifs de Contenu Personnalisés

source: Add Pattern
es: Agregar Patrón
fr: Ajouter un Motif

source: Name:
es: Nombre:
fr: Nom :

source: e.g., employee_id
es: p. ej., id_empleado
fr: par ex., id_employé

source: Description:
es: Descripción:

source: e.g., Company employee ID
es: p. ej., ID de empleado de la empresa
fr: par ex., ID d'employé de l'entreprise

source: Category:
es: Categoría:
fr: Catégorie :

source: Common Patterns ▾
es: Patrones Comunes ▾

source: Test Pattern:
es: Probar Patrón:
fr: Tester le Motif :

source: Enter sample text to test the pattern...
es: Ingrese texto de muestra para probar el patrón...

source: Test Pattern
es: Probar Patrón
fr: Tester le Motif

source: Delete Pattern
es: Eliminar Patrón
fr: Supprimer le Motif

source: <span foreground='green'>✓ Valid regex pattern</span>
es: <span foreground='green'>✓ Patrón regex válido</span>

source: <span foreground='red'>✗ Invalid: {}</span>
es: <span foreground='red'>✗ Inválido: {}</span>

source: <span foreground='orange'>Enter a regex pattern first</span>
es: <span foreground='orange'>Ingrese primero un patrón regex</span>

source: <span foreground='orange'>Enter sample text to test</span>
es: <span foreground='orange'>Ingrese texto de muestra para probar</span>

source: <span foreground='red'>Fix regex errors first</span>
es: <span foreground='red'>Corrija primero los errores de regex</span>

source: <span foreground='green'>✓ Found {} match(es): {}</span>
es: <span foreground='green'>✓ Se encontraron {} coincidencia(s): {}</span>

source: <span foreground='orange'>No matches found in test text</span>
es: <span foreground='orange'>No se encontraron coincidencias en el texto de prueba</span>

source: <span foreground='red'>Test error: {}</span>
es: <span foreground='red'>Error de prueba: {}</span>

source: Employee ID
es: ID de Empleado
fr: ID d'Employé

source: Project Code
es: Código de Proyecto
fr: Code de Projet

source: Account Number
es: Número de Cuenta
fr: Numéro de Compte

source: Internal IP
es: IP Interna
fr: IP Interne

source: Document ID
es: ID de Documento
fr: ID de Document

source: Serial Number
es: Número de Serie
fr: Numéro de Série

source: Phone (US)
es: Teléfono (EE.UU.)
fr: Téléphone (US)

source: Email Domain
es: Dominio de Correo
fr: Domaine Email

source: API Key Format
es: Formato de Clave API
fr: Format de Clé API

source: Common Pattern Templates
es: Plantillas de Patrones Comunes
fr: Modèles de Motifs Communs

source: Pattern: {}
es: Patrón: {}

source: Example: {}
es: Ejemplo: {}

source: File Type Support
es: Soporte de Tipos de Archivo
fr: Support de Types de Fichiers

source: Notifications
es: Notificaciones

source: Main Documentation
es: Documentación Principal
fr: Documentation Principale

source: Available Documentation
es: Documentación Disponible
fr: Documentation Disponible

source: Documentation file not found: {}
es: Archivo de documentación no encontrado: {}
fr: Fichier de documentation introuvable : {}

source: Error loading documentation: {}
es: Error al cargar la documentación: {}
fr: Erreur de chargement de la documentation : {}

source: Encrypted USB detected
es: USB cifrado detectado
fr: USB chiffré détecté

source: Device {device} needs to be unlocked
es: El dispositivo {device} necesita ser desbloqueado
fr: Le périphérique {device} doit être déverrouillé

source: Unlock drive…
es: Desbloquear unidad…
fr: Déverrouiller le lecteur…

source: USB encryption complete
es: Cifrado USB completado
fr: Chiffrement USB terminé

source: Device {device} mounted writable
es: Dispositivo {device} montado con escritura
fr: Périphérique {device} monté en écriture

source: Encrypted USB unlocked
es: USB cifrado desbloqueado
fr: USB chiffré déverrouillé

source: Device {device} is now writable
es: El dispositivo {device} ahora es escribible
fr: Le périphérique {device} est maintenant accessible en écriture

source: Unlock failed
es: Desbloqueo fallido
fr: Échec du déverrouillage

source: Device {device} unlock failed
es: Falló el desbloqueo del dispositivo {device}
fr: Échec du déverrouillage du périphérique {device}

source: Encryption failed
es: Cifrado fallido
fr: Échec du chiffrement

source: Device {device} encryption failed
es: Falló el cifrado del dispositivo {device}
fr: Échec du chiffrement du périphérique {device}

source: USB mounted read-only
es: USB montado solo lectura
fr: USB monté en lecture seule

source: Writing requires encryption.
es: La escritura requiere cifrado.
fr: L'écriture nécessite le chiffrement.

source: Encrypt drive…
es: Cifrar unidad…
fr: Chiffrer le lecteur…

source: ⛔ File Blocked - Sensitive Data Detected
es: ⛔ Archivo bloqueado - Datos sensibles detectados
fr: ⛔ Fichier bloqué - Données sensibles détectées

source: This file contains {n} sensitive pattern and cannot be written to USB.
es: Este archivo contiene {n} patrón sensible y no puede escribirse en USB.
fr: Ce fichier contient {n} motif sensible et ne peut pas être écrit sur USB.

source: Encryption Settings
fr: Échec du chiffrement

source: Encryption Defaults
fr: Échec du chiffrement

source: Default Encryption Type
fr: Échec du chiffrement

source: Encryption Target
fr: Échec du chiffrement

source: Encryption
fr: Échec du chiffrement
